{
    "url": "https://www.floridatoday.com/story/tech/science/space/2025/02/18/spacex-starship-gigabay-proposed-for-rocket-cape-canaveral-florida-kennedy-space-center/78972784007/",
    "text": "SpaceX Starship Gigabay proposed for Cape Canaveral, Florida News Space Sports Opinions Restaurants Advertise Obituaries eNewspaper Legals SPACE SpaceX proposes Cape Canaveral Gigabay for Starship Brooke Edwards Florida Today AI-assisted summary SpaceX plans to begin construction on a 380-foot-tall Starship Gigabay at Kennedy Space Center as early as April 2025. The Gigabay will be used to stack and finalize Super Heavy boosters for Starship launches, similar to the Megabay in Texas. SpaceX aims to launch Starship from Pad 39A at Kennedy Space Center, with the booster landing back on the launch tower. Construction of a large SpaceX facility that could become a recognizable structure at Kennedy Space Center could begin this spring — bringing the possibility of a SpaceX Starbase in Florida closer to reality. A document listed with the Federal Aviation Administration (FAA) shows that SpaceX is looking to break ground as soon as April on what it is calling its Starship Gigabay out at Kennedy Space Center. Filed late last month, the document is listed as \"in progress.\" Coordinates listed show the Starship Gigabay will be at the site of SpaceX's Roberts Road facilities. For reference, this location sits beyond the KSC Visitor Complex, past the security gate. The location itself is not visible to the general public, as in the case of SpaceX's Starbase in Texas − at least not currently. While still in the proposal stage, the 380-foot-tall structure would fall short of NASA's Vehicle Assembly Building , which stands at 525-feet-tall. But at that height, it would still make the Gigabay a recognizable feature looming in the distance on approach to Cape Canaveral. This would give the general public a glimpse of SpaceX's new generation launch system. The FAA did not respond to a request for comment as of publication time. Need a break? Play the USA TODAY Daily Crossword Puzzle. Construction on the Gigabay is proposed to last from April 2025 to August 2026. With NASA's Artemis III mission set to utilize Starship as a human lunar lander as soon as 2027, and SpaceX pushing to send an uncrewed Starship to Mars in late 2026, this timeline adds up. Like the SpaceX Megabay in Texas, the Gigabay would be used to stack and finalize the 232-foot-tall Super Heavy boosters (lower-stages) before flight. Once fully stacked on the launch pad, Starship stands more than 400-feet-tall. While Starship's home base is Texas now, SpaceX has big plans for it to launch from the site of Kennedy Space Center Pad 39A . The fully reusable launch system will ferry everything from crew to cargo. Destinations include Earth orbit and beyond. SpaceX states that Starship will be able to carry up to 100 crew members at a time although it has yet to fly any crewed missions. It will be used to deploy satellites such as SpaceX's Starlink, which SpaceX intended to test during the last flight from Texas. Unfortunately, that January flight ended with the early loss of the Starship, as it broke apart over the Turks and Caicos islands. The Gigabay is a large step towards launching Starship from Florida. SpaceX has Cape Canaveral facilities and already is manufacturing Starship tower segments in Florida and shipping them to Texas by barge. FAA and Space Force environmental impact reviews for Starship at Cape Canaveral are expected to be released this year. Until released, it remains unknown what modifications SpaceX would be expected to make to Starship and the launch locations. When is the next Florida rocket launch? Is there a launch today? Upcoming SpaceX, NASA rocket launch schedule at Cape Canaveral Is there a Starship tower in Florida? A Starship tower has been standing at Kennedy Space Center's Pad 39A for years. Occasional modifications to the tower have been observed by the FLORIDA TODAY Space Team. SpaceX has not commented on what those modifications are, however, Starship's design is altered after every test flight from Starbase, Texas. For example, alternations were made on the last flight to increase the chance of a successful booster catch, which resulted in SpaceX's second ever first-stage booster catch with the \"chopstick\" arms. Starship will not only launch from that Pad 39A tower, but the first-stage booster will land back at the tower, too. This will skip landing on drone ships at sea entirely. SpaceX also plans to eventually catch the Starship (upper stage/ship) as well. That would revolutionize reusability, and could be observed as early as one of the upcoming flights from Texas. A Starship tower is also planned for SpaceX's other Florida launch pad, Cape Canaveral Launch Complex-40 (SLC-40). SpaceX has additional plans to rebuild Launch Complex 37 as well. SpaceX does not just have the 2027 Artemis III moon landing goal to meet, assuming Artemis stays on track under the Trump administration , but they have stated a push to launch an uncrewed Starship to Mars − a major goal of CEO Elon Musk −by late 2026 when the planet is close to Earth. Those remain highly ambitious goals, and with many space goals, the timeframe is likely to slip. It remains to be seen how soon we will see the rise of the Gigabay, or even a Starship launch from Cape Canaveral. Be sure to follow the FLORIDA TODAY Space Team at FloridaToday.com/Space for the latest from the Space Coast. Brooke Edwards is a Space Reporter for Florida Today. Contact her at bedwards@floridatoday.com or on X: @brookeofstars . About Us Corrections Staff Directory Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles Responsible Disclosure Subscription Terms & Conditions Terms of Service Privacy Policy Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Promote your Event Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Cars Homes Classifieds Education Shopping 10Best LocaliQ Digital Marketing Solutions © 2025 www.floridatoday.com. All rights reserved."
}